# Updating Rows and Columns

In [1]:
import pandas as pd

In [2]:
people = {
    "first": ["Corey", 'Jane', 'John'], 
    "last": ["Schafer", 'Doe', 'Doe'], 
    "email": ["CoreyMSchafer@gmail.com", 'JaneDoe@email.com', 'JohnDoe@email.com']
}

In [3]:
df_people = pd.DataFrame(people)

In [4]:
df_people

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [6]:
df_people.columns

Index(['first', 'last', 'email'], dtype='object')

In [8]:
df_people.columns = ['first_name', 'last_name', 'email_id']

In [9]:
df_people

  first_name last_name                 email_id
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@email.com
2       John       Doe        JohnDoe@email.com

In [10]:
# making column name in upper case

df_people.columns = [x.upper() for x in df_people.columns]

In [11]:
df_people

  FIRST_NAME LAST_NAME                 EMAIL_ID
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@email.com
2       John       Doe        JohnDoe@email.com

In [13]:
# changing underscore in column name to space

df_people.columns = df_people.columns.str.replace('_', ' ')

In [14]:
df_people

  FIRST NAME LAST NAME                 EMAIL ID
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@email.com
2       John       Doe        JohnDoe@email.com

In [18]:
df_people.rename(columns = {'FIRST NAME': 'first', 'LAST NAME': 'last', 'EMAIL ID': 'email'}, inplace = True)

In [19]:
df_people

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

# Updating Single Row Data

In [21]:
# changing all values for particular row

df_people.loc[2] = ['John', 'Smith', 'JohnSmith@email.com']

In [22]:
df_people

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John    Smith      JohnSmith@email.com

In [24]:
# changing few values for particular record

df_people.loc[2, ['last', 'email']] = ['Doe', 'JohnDoe@email.com']

In [25]:
df_people

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [26]:
filt = (df_people['email'] == 'JohnDoe@email.com')

In [28]:
df_people.loc[filt]

  first last              email
2  John  Doe  JohnDoe@email.com

In [29]:
df_people.loc[filt, 'last'] = 'Smith'

In [30]:
df_people

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John    Smith        JohnDoe@email.com

# Updating Multiple Row Data

In [33]:
df_people['email'] = df_people['email'].str.lower()

In [34]:
df_people

   first     last                    email
0  Corey  Schafer  coreymschafer@gmail.com
1   Jane      Doe        janedoe@email.com
2   John    Smith        johndoe@email.com

# apply

#### apply is used for calling a function on our values and it can work either on DataFrame or Series object.

###   apply on series object --- when we used it on series they can apply a function to every value in our series

In [35]:
df_people['email'].apply(len)

0    23
1    17
2    17
Name: email, dtype: int64

In [36]:
# function to make email column in upper case

def update_email(email):
    return email.upper()

In [37]:
df_people['email'] = df_people['email'].apply(update_email)

In [38]:
df_people

   first     last                    email
0  Corey  Schafer  COREYMSCHAFER@GMAIL.COM
1   Jane      Doe        JANEDOE@EMAIL.COM
2   John    Smith        JOHNDOE@EMAIL.COM

In [39]:
# lambda function to make email column in lower case

df_people['email'] = df_people['email'].apply(lambda x: x.lower())

In [40]:
df_people

   first     last                    email
0  Corey  Schafer  coreymschafer@gmail.com
1   Jane      Doe        janedoe@email.com
2   John    Smith        johndoe@email.com

###   apply on DataFrame --- when we used it on DataFrame they can apply a function on each row or column of                                                        that DataFrame

In [41]:
df_people.apply(len)

first    3
last     3
email    3
dtype: int64

In [42]:
df_people.apply(len, axis='columns')

0    3
1    3
2    3
dtype: int64

In [43]:
df_people.apply(pd.Series.min)

first                      Corey
last                         Doe
email    coreymschafer@gmail.com
dtype: object

In [44]:
df_people.apply(lambda x: x.min())

first                      Corey
last                         Doe
email    coreymschafer@gmail.com
dtype: object

# applymap

#### It apply function on every individual element in DataFrame. It only works on DataFrame objects

In [45]:
df_people.applymap(len)

   first  last  email
0      5     7     23
1      4     3     17
2      4     5     17

In [46]:
df_people.loc[1:2, ['first', 'email']].applymap(len)

   first  email
1      4     17
2      4     17

In [47]:
df_people['first'].map({'Corey': 'Saurabh', 'John': 'Jolly'})

0    Saurabh
1        NaN
2      Jolly
Name: first, dtype: object

In [50]:
df_people['first'] = df_people['first'].replace({'Corey': 'Saurabh', 'John': 'Jolly'})

In [51]:
df_people

     first     last                    email
0  Saurabh  Schafer  coreymschafer@gmail.com
1     Jane      Doe        janedoe@email.com
2    Jolly    Smith        johndoe@email.com